app/controllers/welcome_controller.rb

  def hello
    @credentials = Rails.application.credentials.hello
    @variable = Federation.first.name
---
SELECT "federations".* FROM "federations" ORDER BY "federations"."id" ASC LIMIT $1  [["LIMIT", 1]]